hedrickbt/TempSensor/Packages/.cache/Keil.STM32L0xx_DFP.1.5.0.pdsc
          <variant Dvariant="STM32L083VZIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L083VZTx"> <feature type="QFP" n="100"/> </variant>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32L011">
      <description>STMicroelectronics STM32L011 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L011*"/>
    </condition>
    <condition id="STM32L021">
      <description>STMicroelectronics STM32L021 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L021*"/>
    </condition>
    <condition id="STM32L031">
      <description>STMicroelectronics STM32L031 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L031*"/>
    </condition>
    <condition id="STM32L041">
      <description>STMicroelectronics STM32L041 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L041*"/>
    </condition>
    <condition id="STM32L051">
      <description>STMicroelectronics STM32L051 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L051*"/>
    </condition>
    <condition id="STM32L052">
      <description>STMicroelectronics STM32L052 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L052*"/>
    </condition>
    <condition id="STM32L053">
      <description>STMicroelectronics STM32L053 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L053*"/>
    </condition>
    <!--condition id="STM32L061">
      <description>STMicroelectronics STM32L061 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L061*"/>
    </condition-->
    <condition id="STM32L062">
      <description>STMicroelectronics STM32L062 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L062*"/>
    </condition>
    <condition id="STM32L063">
      <description>STMicroelectronics STM32L063 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L063*"/>
    </condition>
    <condition id="STM32L071">
      <description>STMicroelectronics STM32L071 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L071*"/>
    </condition>
    <condition id="STM32L072">
      <description>STMicroelectronics STM32L072 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L072*"/>
    </condition>
    <condition id="STM32L073">
      <description>STMicroelectronics STM32L073 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L073*"/>
    </condition>
    <condition id="STM32L081">
      <description>STMicroelectronics STM32L081 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L081*"/>
    </condition>
    <condition id="STM32L082">
      <description>STMicroelectronics STM32L082 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L082*"/>
    </condition>
    <condition id="STM32L083">
      <description>STMicroelectronics STM32L083 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L083*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32L011 CMSIS">
      <description>STMicroelectronics STM32L011 Devices and CMSIS-Core</description>
      <require condition="STM32L011"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L021 CMSIS">
      <description>STMicroelectronics STM32L021 Devices and CMSIS-Core</description>
      <require condition="STM32L021"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L031 CMSIS">
      <description>STMicroelectronics STM32L031 Devices and CMSIS-Core</description>
      <require condition="STM32L031"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L041 CMSIS">
      <description>STMicroelectronics STM32L041 Devices and CMSIS-Core</description>
      <require condition="STM32L041"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L051 CMSIS">
      <description>STMicroelectronics STM32L051 Devices and CMSIS-Core</description>
      <require condition="STM32L051"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L052 CMSIS">
      <description>STMicroelectronics STM32L052 Devices and CMSIS-Core</description>
      <require condition="STM32L052"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L053 CMSIS">
      <description>STMicroelectronics STM32L053 Devices and CMSIS-Core</description>
      <require condition="STM32L053"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <!--condition id="STM32L061 CMSIS">
      <description>STMicroelectronics STM32L061 Devices and CMSIS-Core</description>
      <require condition="STM32L061"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition-->
    <condition id="STM32L062 CMSIS">
      <description>STMicroelectronics STM32L062 Devices and CMSIS-Core</description>
      <require condition="STM32L062"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L063 CMSIS">
      <description>STMicroelectronics STM32L063 Devices and CMSIS-Core</description>
      <require condition="STM32L063"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L071 CMSIS">
      <description>STMicroelectronics STM32L071 Devices and CMSIS-Core</description>
      <require condition="STM32L071"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L072 CMSIS">
      <description>STMicroelectronics STM32L072 Devices and CMSIS-Core</description>
      <require condition="STM32L072"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
