hedrickbt/TempSensor/Packages/.cache/Keil.STM32L0xx_DFP.1.5.0.pdsc
    <condition id="STM32L073 CMSIS">
      <description>STMicroelectronics STM32L073 Devices and CMSIS-Core</description>
      <require condition="STM32L073"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L081 CMSIS">
      <description>STMicroelectronics STM32L081 Devices and CMSIS-Core</description>
      <require condition="STM32L081"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L082 CMSIS">
      <description>STMicroelectronics STM32L082 Devices and CMSIS-Core</description>
      <require condition="STM32L082"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L083 CMSIS">
      <description>STMicroelectronics STM32L083 Devices and CMSIS-Core</description>
      <require condition="STM32L083"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup STM32L011 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L011 CMSIS">
      <description>System Startup for STMicroelectronics STM32L011 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l011xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L021 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L021 CMSIS">
      <description>System Startup for STMicroelectronics STM32L021 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l021xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L031 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L031 CMSIS">
      <description>System Startup for STMicroelectronics STM32L031 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l031xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L041 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L041 CMSIS">
      <description>System Startup for STMicroelectronics STM32L041 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l041xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L051 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L051 CMSIS">
      <description>System Startup for STMicroelectronics STM32L051 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l051xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L052 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L052 CMSIS">
      <description>System Startup for STMicroelectronics STM32L052 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l052xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L053 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L053 CMSIS">
      <description>System Startup for STMicroelectronics STM32L053 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l053xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L061 -->
    <!--component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L061 CMSIS">
      <description>System Startup for STMicroelectronics STM32L061 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l061xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component-->

    <!-- Startup STM32L062 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L062 CMSIS">
      <description>System Startup for STMicroelectronics STM32L062 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l062xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L063 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L063 CMSIS">
      <description>System Startup for STMicroelectronics STM32L063 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l063xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L071 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L071 CMSIS">
      <description>System Startup for STMicroelectronics STM32L071 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l071xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L072 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L072 CMSIS">
      <description>System Startup for STMicroelectronics STM32L072 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l072xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L073 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L073 CMSIS">
      <description>System Startup for STMicroelectronics STM32L073 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l073xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L081 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L081 CMSIS">
      <description>System Startup for STMicroelectronics STM32L081 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l081xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L082 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L082 CMSIS">
      <description>System Startup for STMicroelectronics STM32L082 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l082xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L083 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L083 CMSIS">
      <description>System Startup for STMicroelectronics STM32L083 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l083xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

